-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2024-03-15 04:34:25
-- サーバのバージョン： 10.4.27-MariaDB
-- PHP のバージョン: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `tsumigee-list`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `makers`
--

CREATE TABLE `makers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `furigana` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- テーブルのデータのダンプ `makers`
--

INSERT INTO `makers` (`id`, `name`, `furigana`, `created_at`, `updated_at`) VALUES
(1, '任天堂', 'ニンテンドウ', '2024-03-04 07:41:36', '2024-03-04 07:41:36'),
(2, 'コナミデジタルエンタテインメント', 'コナミデジタルエンタテインメント', '2024-03-04 07:41:36', '2024-03-04 07:41:36'),
(3, 'フリュー', 'フリュー', '2024-03-04 08:03:11', '2024-03-04 08:03:11'),
(4, 'スパイク・チュンソフト', 'スパイクチュンソフト', '2024-03-04 08:03:41', '2024-03-04 08:03:41'),
(5, 'コンパイルハート', 'コンパイルハート', '2024-03-04 08:03:56', '2024-03-04 08:03:56'),
(6, 'セガ', 'セガ', '2024-03-04 08:04:19', '2024-03-04 08:04:19'),
(7, 'GN Software', 'ジーエヌソフトウェア', '2024-03-04 08:05:16', '2024-03-04 08:05:16'),
(8, 'バンダイナムコエンターテインメント', 'バンダイナムコエンターテインメント', '2024-03-04 08:05:33', '2024-03-04 08:05:33'),
(9, 'アトラス', 'アトラス', '2024-03-04 08:06:01', '2024-03-04 08:06:01'),
(10, 'マーベラス', 'マーベラス', '2024-03-04 08:06:29', '2024-03-04 08:06:29'),
(11, 'ソニー・インタラクティブエンタテインメント', 'ソニーインタラクティブエンタテインメント', '2024-03-04 08:07:12', '2024-03-04 08:07:12'),
(12, 'KADOKAWA', 'カドカワ', '2024-03-04 08:11:59', '2024-03-04 08:11:59'),
(13, 'スクウェア・エニックス', 'スクウェアエニックス', '2024-03-04 08:40:01', '2024-03-04 08:40:01'),
(14, 'カプコン', 'カプコン', '2024-03-09 01:39:09', '2024-03-09 01:39:09'),
(15, 'フロム・ソフトウェア', 'フロムソフトウェア', '2024-03-09 02:02:02', '2024-03-09 02:02:02'),
(16, 'PLAYISM', 'プレーイズム', '2024-03-09 02:05:08', '2024-03-09 02:05:08'),
(17, '日本ファルコム', 'ニホンファルコム', '2024-03-09 02:06:45', '2024-03-09 02:06:45'),
(18, 'インティ・クリエイツ', 'インティクリエイツ', '2024-03-09 02:07:43', '2024-03-09 02:07:43'),
(19, 'MAGES.', 'メージス', '2024-03-09 02:16:52', '2024-03-09 02:16:52'),
(20, 'Rockstar Games', 'ロックスターゲームス', '2024-03-09 02:27:14', '2024-03-09 02:27:14'),
(21, 'エレクトロニック・アーツ', 'エレクトロニックアーツ', '2024-03-09 02:30:05', '2024-03-09 02:30:05'),
(22, 'dramatic create', 'ドラマティッククリエイト', '2024-03-09 02:32:18', '2024-03-09 02:32:18'),
(23, 'エンターグラム', 'エンターグラム', '2024-03-09 02:33:05', '2024-03-09 02:33:05'),
(24, 'プロトタイプ', 'プロトタイプ', '2024-03-09 02:34:56', '2024-03-09 02:34:56'),
(25, 'AQUAPLUS', 'アクアプラス', '2024-03-09 02:36:19', '2024-03-09 02:36:19'),
(26, '8-4', 'ハチノヨン', '2024-03-09 02:37:16', '2024-03-09 02:37:16'),
(27, 'コーエーテクモゲームス', 'コーエーテクモゲームス', '2024-03-09 02:37:56', '2024-03-09 02:37:56'),
(28, 'SUPERDELUXE GAMES', 'スーパーデラックスゲームス', '2024-03-09 02:54:42', '2024-03-09 02:54:42'),
(29, 'ベセスダ・ソフトワークス', 'ベセスダソフトワークス', '2024-03-09 03:41:45', '2024-03-09 03:41:45'),
(30, 'Ubisoft', 'ユービーアイソフト', '2024-03-09 03:42:58', '2024-03-09 03:42:58'),
(31, 'マイクロソフト', 'マイクロソフト', '2024-03-09 04:02:20', '2024-03-09 04:02:20'),
(32, 'ディースリー・パブリッシャー', 'ディースリーパブリッシャー', '2024-03-09 04:06:50', '2024-03-09 04:06:50'),
(33, 'KID', 'キッド', '2024-03-09 04:29:10', '2024-03-09 04:29:10'),
(34, 'アニプレックス', 'アニプレックス', '2024-03-09 04:39:21', '2024-03-09 04:39:21'),
(35, 'ブシロード', 'ブシロード', '2024-03-11 09:24:51', '2024-03-11 09:24:51'),
(36, '戯画', 'ギガ', '2024-03-12 02:39:54', '2024-03-12 02:39:54'),
(37, 'sprite', 'スプライト', '2024-03-12 02:40:19', '2024-03-12 02:40:19'),
(38, 'SAGA PLANETS', 'サガプラネッツ', '2024-03-12 02:40:40', '2024-03-12 02:40:40'),
(39, 'Qruppo', 'クルッポー', '2024-03-12 02:40:55', '2024-03-12 02:40:55'),
(40, 'きゃべつそふと', 'キャベツソフト', '2024-03-12 02:41:13', '2024-03-12 02:41:13'),
(42, 'ゆずソフト', 'ユズソフト', '2024-03-12 02:41:28', '2024-03-12 02:41:28'),
(43, 'ぱれっと', 'パレット', '2024-03-12 02:41:42', '2024-03-12 02:41:42'),
(44, 'FAVORITE', 'フェイバリット', '2024-03-12 02:41:57', '2024-03-12 02:41:57'),
(45, 'Navel', 'ネーブル', '2024-03-12 02:42:25', '2024-03-12 02:42:25'),
(46, '枕', 'マクラ', '2024-03-12 02:53:07', '2024-03-12 02:53:07'),
(47, 'シルキーズプラス', 'シルキーズプラス', '2024-03-12 02:56:49', '2024-03-12 02:56:49'),
(48, 'FrontWing', 'フロントウィング', '2024-03-12 02:56:58', '2024-03-12 02:56:58'),
(49, 'Innocent Grey', 'イノセントグレイ', '2024-03-12 02:57:06', '2024-03-12 02:57:06'),
(50, 'âge', 'アージュ', '2024-03-12 02:57:15', '2024-03-12 02:57:15'),
(51, 'ケロQ', 'ケロキュー', '2024-03-12 02:57:21', '2024-03-12 02:57:21'),
(52, 'NitroPlus', 'ニトロプラス', '2024-03-12 02:57:28', '2024-03-12 02:57:28'),
(53, 'CROSS†CHANNEL', 'クロスチャンネル', '2024-03-12 02:58:19', '2024-03-12 02:58:19'),
(54, 'Circus', 'サーカス', '2024-03-12 03:00:09', '2024-03-12 03:00:09'),
(55, 'あかべぇそふとつぅ', 'アカベェソフトツゥ', '2024-03-12 03:19:02', '2024-03-12 03:19:02'),
(56, 'Leaf', 'リーフ', '2024-03-12 03:19:26', '2024-03-12 03:19:26'),
(57, 'HERMIT', 'ハーミット', '2024-03-12 03:30:35', '2024-03-12 03:30:35'),
(58, '日本テレネット', 'ニホンテレネット', '2024-03-12 03:41:48', '2024-03-12 03:41:48'),
(59, 'タイトー', 'タイトー', '2024-03-12 03:48:02', '2024-03-12 03:48:02'),
(60, 'セタ', 'セタ', '2024-03-12 03:52:13', '2024-03-12 03:52:13'),
(61, 'SNK', 'エスエヌケー', '2024-03-12 03:58:28', '2024-03-12 03:58:28'),
(62, 'BPS', 'ビーピーエス', '2024-03-12 04:07:45', '2024-03-12 04:07:45'),
(63, 'トミー', 'トミー', '2024-03-12 04:09:41', '2024-03-12 04:09:41'),
(64, '日本物産', 'ニホンブッサン', '2024-03-12 04:19:55', '2024-03-12 04:19:55');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `makers`
--
ALTER TABLE `makers`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `makers`
--
ALTER TABLE `makers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=65;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
